base/InformationRegisters/бит_УдалитьНастройкиДоступностиЭлементовУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_УдалитьНастройкиДоступностиЭлементовУправления</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Доступность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Видимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроизвольноеУсловие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяЭлементаУправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УдалитьХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/Enums/бит_ВидыОбъектовСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектовСистемы</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
					<Comment>План счетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
					<Comment>План видов характеристик</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрНакопления</Name>
					<Comment>Регистр накопления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Comment>Регистр бухгалтерии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
					<Comment>Задача</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Comment>Бизнес процесс</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/InformationRegisters/бит_УдалитьНастройкиДоступностиЭлементовУправления/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.бит_УдалитьНастройкиДоступностиЭлементовУправления;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Связи параметров выбора.
	НовыйМассив = Новый Массив;
	
	РежимОчищать = РежимИзмененияСвязанногоЗначения.Очищать;
	Связь_ОбъектСитемы = Новый СвязьПараметраВыбора("Отбор.ОбъектСистемы", "Запись.ОбъектСистемы", РежимОчищать);
	Связь_ТипФормы     = Новый СвязьПараметраВыбора("Отбор.ТипФормы", "Запись.ТипФормы", РежимОчищать);
	
	НовыйМассив.Добавить(Связь_ОбъектСитемы);
	МассивСвязей_ТипФормы = Новый ФиксированныйМассив(НовыйМассив); 
	Элементы.ТипФормы.СвязиПараметровВыбора = МассивСвязей_ТипФормы;

	НовыйМассив.Добавить(Связь_ТипФормы);
	МассивСвязей_ИмяЭлемента = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.ИмяЭлементаУправления.СвязиПараметровВыбора = МассивСвязей_ИмяЭлемента;
	  	
	ЗаполнитьКэшЗначений();
	
	Если Запись.ТипФормы = "Управляемая" Тогда
		Элементы.Видимость.Доступность = Истина;
		Элементы.Обязательное.Доступность = Истина;
	КонецЕсли;
	
	ВидимостьПоляХозОперация();
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПользовательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить(Тип("СправочникСсылка.ГруппыПользователей"));
	СписокТипов.Добавить(Тип("СправочникСсылка.Пользователи"));
	
	ВыбранныйТип = ЭтотОбъект.ВыбратьИзСписка(СписокТипов);
	
	Если ВыбранныйТип <> Неопределено Тогда
		
		МассивТипов = Новый Массив;
  		МассивТипов.Добавить(ВыбранныйТип.Значение);
 		Описание = Новый ОписаниеТипов(МассивТипов);
        Элемент.ОграничениеТипа = Описание;

		Элемент.ВыбиратьТип = Ложь;
		
 	КонецЕсли; 

КонецПроцедуры // ПользовательНачалоВыбора()

&НаКлиенте
Процедура ОбъектСистемыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	СписокВидовОбъектов = Новый СписокЗначений;
	СписокВидовОбъектов.Добавить(фКэшЗначений.ВидОбъектаДокумент);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидыОбъектов"           , СписокВидовОбъектов);
	ПараметрыФормы.Вставить("ТекущийОбъектСистемы"   , Запись.ОбъектСистемы);
	ПараметрыФормы.Вставить("ДоступныеОбъектыСистемы", фКэшЗначений.ДоступныеОбъектыСистемы);
	ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораОбъектовСистемы", ПараметрыФормы,Элемент);
	
КонецПроцедуры // ОбъектСистемыНачалоВыбора()

&НаКлиенте
Процедура ОбъектСистемыПриИзменении(Элемент)
	
	ВидимостьПоляХозОперация();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипФормыПриИзменении(Элемент)
	
	Если Запись.ТипФормы = "Управляемая" Тогда
		Элементы.Видимость.Доступность = Истина;
		Элементы.Обязательное.Доступность = Истина;
	Иначе 	
	    Запись.Видимость = Истина;
		Элементы.Видимость.Доступность = Ложь;
		Элементы.Обязательное.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ТипФормыПриИзменении()

&НаКлиенте
Процедура ИмяЭлементаУправленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	фТекущееИмяЭлементаУправления = Запись.ИмяЭлементаУправления;
	                             
	// Откроем форму выбора элемента управления
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектСистемы", Запись.ОбъектСистемы);
	ПараметрыФормы.Вставить("ТекущееИмя"   , Запись.ИмяЭлементаУправления);
	ПараметрыФормы.Вставить("ТипФормы"     , Запись.ТипФормы);
	
	Оповещение = Новый ОписаниеОповещения("ИмяЭлементаУправленияНачалоВыбораОкончание", ЭтотОбъект); 
	ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораИмениЭлемента",ПараметрыФормы,ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры // ИмяЭлементаУправленияНачалоВыбора()
&НаКлиенте
Процедура СтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьСпиокВыбораСтатусов(Запись.ОбъектСистемы);
		
КонецПроцедуры // СтатусНачалоВыбора()

&НаКлиенте
Процедура ДоступностьПриИзменении(Элемент)
	
	Если Запись.ТипФормы = "Управляемая" 
		И Запись.Доступность Тогда
	
		Запись.Видимость = Истина;	
	
	КонецЕсли;
	
	Если НЕ Запись.Доступность Тогда
	
		Запись.Обязательное = Ложь;
	
	КонецЕсли;
	
КонецПроцедуры // ДоступностьПриИзменении()

&НаКлиенте
Процедура ВидимостьПриИзменении(Элемент)
	
	Если Запись.ТипФормы = "Управляемая" 
		И Не Запись.Видимость Тогда
	
		Запись.Доступность  = Ложь;	
		Запись.Обязательное = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // ВидимостьПриИзменении()

&НаКлиенте
Процедура ОбязательноеПриИзменении(Элемент)
	
	Если Запись.Обязательное Тогда
	
		Запись.Доступность = Истина;
		Запись.Видимость   = Истина;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//  Процедура управляет видимостью поля хозяйственная операция 
//
&НаСервере
Процедура ВидимостьПоляХозОперация()

	Спр = Справочники.бит_ОбъектыСистемы.НайтиПоНаименованию(Запись.ОбъектСистемы);
	Если Спр.ИмяОбъекта = "бит_кзн_ПлатежнаяПозиция" 
		ИЛИ Спр.ИмяОбъекта = "бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств"
		ИЛИ Спр.ИмяОбъекта = "бит_кзн_ЗаявкаНаРасходованиеСредств" Тогда 
	
		Элементы.ХозяйственнаяОперация.Видимость = Истина;
		
	Иначе 
		Элементы.ХозяйственнаяОперация.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры // ВидимостьПоляХозОперация()

// Процедура окончание процедуры "ИмяЭлементаУправленияНачалоВыбора".
// 
&НаКлиенте 
Процедура ИмяЭлементаУправленияНачалоВыбораОкончание(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
	
		// Сохраним результат выбора
		Запись.ИмяЭлементаУправления = ?(ЗначениеЗаполнено(РезультатВыбора), РезультатВыбора, фТекущееИмяЭлементаУправления);
		фТекущееИмяЭлементаУправления = Запись.ИмяЭлементаУправления;
	
	КонецЕсли; 
	
КонецПроцедуры // ИмяЭлементаУправленияНачалоВыбораОкончание()

// Процедура заполняет кэш значений.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений()
     	
	// Кеш значений
	фКэшЗначений = Новый Структура;
	
	ВидыОбъектов.Добавить(Перечисления.бит_ВидыОбъектовСистемы.Документ);
	фКэшЗначений.Вставить("ВидОбъектаДокумент" ,Перечисления.бит_ВидыОбъектовСистемы.Документ);
	
	// Доступные объекты
	ДоступныеОбъектыСистемы = бит_ВизированиеСервер.ВизируемыеОбъектыСистемы();
	ДобавитьОбъектВСписок(ДоступныеОбъектыСистемы, "бит_вго_ПодтверждениеСверкиВГО");
	ДобавитьОбъектВСписок(ДоступныеОбъектыСистемы, "бит_кзн_ПлатежнаяПозиция");
	ДобавитьОбъектВСписок(ДоступныеОбъектыСистемы, "бит_кзн_ПозицияПоступления");
	УдалитьОбъектИзСписка(ДоступныеОбъектыСистемы, "бит_ВерсияОтчета"); 		
	фКэшЗначений.Вставить("ДоступныеОбъектыСистемы", ДоступныеОбъектыСистемы);

КонецПроцедуры // ЗаполнитьКэшЗначений()

// Процедура добавляет объект в список.
//
// Параметры:
//  ДоступныеОбъектыСистемы - СписокЗначений.
//  ИмяДокумента  			- Строка.
//
&НаСервереБезКонтекста
Процедура ДобавитьОбъектВСписок(ДоступныеОбъектыСистемы, ИмяДокумента)

	ОбъектМета = Метаданные.Документы.Найти(ИмяДокумента);
	Если ОбъектМета <> Неопределено Тогда
		ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(ОбъектМета);
		ДоступныеОбъектыСистемы.Добавить(ОбъектСистемы);
	КонецЕсли;

КонецПроцедуры // ДобавитьОбъектВСписок()

// Процедура удаляет объект из списка.
//
// Параметры:
//  ДоступныеОбъектыСистемы - СписокЗначений.
//  ИмяДокумента  			- Строка.
//
&НаСервереБезКонтекста
Процедура УдалитьОбъектИзСписка(ДоступныеОбъектыСистемы, ИмяДокумента)

	ОбъектМета = Метаданные.Документы.Найти(ИмяДокумента);
	Если ОбъектМета <> Неопределено Тогда
		ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(ОбъектМета);
		ЭлементУдаляемый = ДоступныеОбъектыСистемы.НайтиПоЗначению(ОбъектСистемы);
		Если ЭлементУдаляемый <> Неопределено Тогда
			ДоступныеОбъектыСистемы.Удалить(ЭлементУдаляемый);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // УдалитьОбъектИзСписка()

// Функция получает список выбора статусов по объекту системы.
//
// Параметры:
//  ОбъектСистемы - СправочникСсылка.бит_ОбъектыСистемы.
//  
// Возвращаемое значение:
//   Список значений.
//
&НаСервереБезКонтекста
Функция ПолучитьСпиокВыбораСтатусов(ОбъектСистемы)

	Если ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Метаданные.Документы.бит_кзн_ПлатежнаяПозиция) Тогда	
		ОбъектНов = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Метаданные.Документы.бит_кзн_ЗаявкаНаРасходованиеСредств);	
	ИначеЕсли ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Метаданные.Документы.бит_кзн_ПозицияПоступления) Тогда		
		ОбъектНов = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Метаданные.Документы.бит_кзн_ПланируемоеПоступлениеДенежныхСредств);		
	Иначе 		
		ОбъектНов = ОбъектСистемы;		
	КонецЕсли;	
		
	ДанныеВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектСистемы", ОбъектНов);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	бит_СтатусыОбъектов.Ссылка
	|ИЗ
	|	Справочник.бит_СтатусыОбъектов КАК бит_СтатусыОбъектов
	|ГДЕ
	|	бит_СтатусыОбъектов.Объект = &ОбъектСистемы
	|";
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка);	
	КонецЦикла;                               		

	Возврат ДанныеВыбора;
	
КонецФункции // ПолучитьСпиокВыбораСтатусов()

#КонецОбласти
